[
    {"courseID":"C1001","course":"Exchange Semester Course Choices","name": "ERASMUS study semester + work experience", "description": "Students can study either in English or German; Tourism Management, General Business and General Engineering are study programmes which were developed specifically according to the needs of our international exchange students, thus, they are taught in English. Besides, we offer many other top German degrees among eight faculties. After the study semester (either at our main campus in Deggendorf or our European Campus in Pfarrkirchen) students complete a single semester internship directly at the Deggendorf Institute of Technology, or receive support to find an internship position in a partnering German company. We support with (preparatory or regular) German language courses, intercultural training and soft skill workshops, and simplify VISA and work permits."},
    {"courseID":"C1002","course":"Exchange Semester Course Choices","name": "General Business exchange semester", "description": "Course content*:\nThe General Business programme, tailored especially to business and tourism students, is an exchange semester in which Bachelors students can complete one or two semesters whilst earning between 20-30 ECTS per semester. From a wide variety of business subjects (all taught in English), participating students can choose the ones that suit their degree course at home. Additionally, students have the opportunity to attend German language classes."},
    {"courseID":"C1003","course":"Exchange Semester Course Choices","name": "Master of Strategic and International Management", "description": "1.restricted admissions for exchange students (applications are only possible upon request)\n2. summer semester: 100 % in English\n 3. module handbook"},
    {"courseID":"C2001","course":"Applying as an Exchange Student","name": "Language skills", "description": "All exchange students must participate in a German course during the semester. Additionally, an intensive German course (level A1) is offered during the Orientation Week which is 1-2 weeks before the start of studies. Language certificates are not required."},
    {"courseID":"C2002","course":"Applying as an Exchange Student","name": "Application period", "description": "The online application portal is only activated during the following application periods: \n 1. 1 April - 1 June for October entries \n 2. 1 October - 1 December for March entries"},
    {"courseID":"C2003","course":"Applying as an Exchange Student","name": "How to apply", "description": "View the application procedure checklist to guide you step-by-step through preparation for your exchange semester at DIT. \n Exchange students apply via Mobility Online. \n After completing the online application form, you will receive an email containing a link and login details. You then must follow the link and enter a password, before entering further details and uploading your documents (such as CV, photo, copy of passport, grade sheet, certificate of enrolment)."},
    {"courseID":"C3001","course":"International courses","name": "Masters programmes", "description": "1. Master Applied Computer Science. \n 2. Master Applied Research in Engineering Sciences. \n 3. Master Artificial Intelligence and Data Science.  \n 4. Master Artificial Intelligence for Smart Sensors and Actuators"},
    {"courseID":"C3002","course":"International courses","name": "Bachelors programmes", "description": "1. Bachelor Artificial Intelligence. \n 2. Bachelor Energy Systems Engineering \n 3. Bachelor Health Informatics. \n 4. Bachelor Industrial Engineering"},
    {"courseID":"C3003","course":"German language for Internationals","name": "Lessons", "description": "1.German as a foreign language (DaF), with more than 500 lessons in the morning. \n 2. DaF Tutorials with over 80 lessons in the afternoon. \n 3. Technical tutorials (in Mathematics, Physics and IT), during the afternoon (block lectures). \n 4. Various workshops, such as intercultural trainings, team building, etc."},
    {"courseID":"C3004","course":"German language for Internationals","name": "Application", "description": "Let's get started takes place annually in the summer semester from mid-March to August.Start date for 2022: Thu 10 March. \n The application period is the 1 September of the previous year as long as there are capacities (limited number of participants).<br>Sign-up online."},
    {"courseID":"C4001","course":"A Study Semester Abroad","name": "Erasmus+ studies", "description": "Erasmus+ is a European scholarship programme, which supports, promotes and funds student mobility around Europe. Through the Erasmus+ agreement, participating universities commit to: <p>Not charge any additional tuition fees</p> <p>Support incoming students to find accommodation</p><p>Recognise exam results earned by students in the relevant degree course at their home university</p>"},
    {"courseID":"C4002","course":"A Study Semester Abroad","name": "Independent Study Abroad or Applying through an agency", "description": "You are completely free to choose any university, even as a free mover student, i.e. outside of existing university cooperations. The International Office will be happy to help and guide you.<p>Please register as a free mover student on Mobility Online, because even if you apply independently you can receive financial support through grants or scholarship programmes.</p>"},
    {"courseID":"C4003","course":"A Study Semester Abroad","name": "Study abroad at a partner university", "description": "The annual deadline is the 15th February for an exchange semester in the following academic year (winter and summer semester).<p>In mid March all applicants will be informed via e-mail at which partner university they've been accepted, and which further documents need to be handed in to the International Office in B 210 to secure their place.</p><p>After the nomination through the university: submit Learning Agreement (external and internal) together with the application documents for your host university to the International Office.</p>"},
    {"courseID":"C5001","course":"An Internship Abroad","name": "Compulsory Internshipss", "description": "Worldwide internships: \n After attending the introductory event, arrange a personal consultation to clarify individual enquiries and look on iLearn. Company vacancies can be found on the DIT online jobboard. Additionally, you can apply to the International Office for funding or scholarships.\n European internships: \n Students who intend to undertake a 60+ day internship in Europe or Island, Liechtenstein, Norway, or Turkey can apply for a scholarship via the International Office. Your internship salary or financial situation is NOT relevant! Please contact Nicole Springer in the International Office.\\n Student-to-student exchange can be viewed on the DAAD EU-community website."},
    {"courseID":"C5002","course":"An Internship Abroad","name": "Short Internship in the semester break", "description": "A short work experience is more about gaining intercultural competence and knowledge of the German language, so keep your mind open and also consider a voluntary job. You'll learn German fast if you work!"},
    {"courseID":"C5003","course":"An Internship Abroad","name": "On Returning to DIT", "description": "Hand in or upload your Erasmus+ documents, if applicable. Write a summary about your experience in our Praktikumsverwaltung for other students' to read. Please tell us about your experience at National Days or International Week events."},
    {"courseID":"C5004","course":"An Internship Abroad","name": "Read Student reviews", "description": "Check out our university blog to see images and read reviews from student experiences during their internships abroad."},
    {"courseID":"C6001","course":"Career Seminars","name": "Training to be a supervisor course (AdA course)", "description": "You will learn to organize, carry out and control learning tasks independently and thereby support the practical learning process of the trainees you will later be responsible for in your professional life.\n Fundamental questions about apprenticeships. \n Planning and implementing the apprenticeship. \n Legal foundations of apprenticeships"},
    {"courseID":"C6002","course":"Career Seminars","name": "AWP subject Professional and personal skills", "description": "The AWP subject Professional and Personal Skills of the Career Service is designed to enable students to acquire and support personal, social and methodological skills in addition to the acquisition of professional skills. \n The aim is to further develop the key qualifications. \n The AWP subject consists of two sub-sections: Professional Competence and Study and Personality Competence. \n Professional competence: Application. \n The seminars deal with the written application, the interview, assessment centre and various selection procedures. The aim is to prepare for the start of a career. \n Study and personal competence: Topics such as rhetoric, communication, presentation and computer office programs as well as scientific work and intercultural training."},
    {"courseID":"C6003","course":"Career Seminars","name": "PLV Career Courses and Seminars", "description": "PLV courses are practical courses, the first one being before your internship and the second course after your internship. Some degree programmes have integrated Career Service seminars as part of the first practical course.    "},
    {"courseID":"C7001","course":"Mentoring Programme","name": "MovING for Engineering students", "description": "Mentoring begins at the start of the summer semester. The students are assisted and supported by their mentor for one year. Meetings between mentor and mentee can be scheduled informally at any time and as needed. The mentoring relationship is developed and deepened through relaxed meetings and get togethers.   \n If you are interested in participating contact Stefanie Möginger."},
    {"courseID":"C7002","course":"Mentoring Programme","name": "First semester support programme", "description": "As a student in your first sermester, you may feel overwhelmed at the start of your studies in the first semester. The transition from a regulated school environment to an independent, academic approach to studying and revising is often difficult. \n We aim to support you and all freshers at the start of their studies, so you can integrate into university life and complete your studies efficiently and successfully. \n Supporters are students in higher semesters from all courses. "},
    {"courseID":"C7003","course":"Mentoring Programme","name": "International Mentoring Programme", "description": "In our International Mentor Programme, we connect international students with alumni of DIT, themselves with an international background, who have successfully entered the German economy after their studies.\n The programme is completely virtual and starts in November for the winter semester and in April for the summer semester. \n Over a period of six months, the alumni (mentors) support their mentee in coping with new challenges and in their professional and personal development. Especially with regard to living and working in Germany. "},
    {"courseID":"C8001","course":"Intensive Language Courses","name": "Accreditation", "description": "For intensive language courses: \n 1.Electives (2 ECTS) \n 2. Compulsory languages (2 ECTS). \n 3. Voluntary subjects (no ECTS!). \n It doesn't make any difference to the credits which semester the course is taken in.Please note, however, that intensive language courses can't replace faculty language classes."},
    {"courseID":"C8002","course":"Intensive Language Courses","name": "Registration", "description": "Registration is possible before 09.12.2020, 23.59 via the following link:https://pmit-ext.th-deg.de/awp/login. Courses will start with a min. of 15 participants. Places are limited."},
    {"courseID":"C8003","course":"Intensive Language Courses","name": "Participating as a non-student", "description": "Non-students may participate in language courses as long as there are availbale places.\n Registration: sprachenzentrum@th-deg.de. \nCourse participation unfortunately does not allow student status and guests are therefore not entitled to sit language  exams."},
    {"courseID":"C8004","course":"Intensive Language Courses","name": "Fees", "description": "due to the exceptional circumstances during the winter semester 20/21: no registration fee for students of DIT!\n 2 SWS-courses: \n 1. € 39 per week for students (including students from other universities) school pupils and apprentices. \n 2.€ 120 per week for non-students, including exam resistration and results. Non-students will recieve a receipt on payment.   \n  4 SWS-courses: \n 1. € 78 per week for students (including students from other universities) school pupils and apprentices. \n 2. € 240 per week for non-students, including exam resistration and results. Non-students will recieve a receipt on payment."},
    {"courseID":"C8005","course":"Intensive Language Courses","name": "Exam results", "description": "Grades are automatically printed on your grade sheet approx. 4 weeks after completion of the intensive course.Registration is automatic and does not require prior exam registration via Primuss.Upon passing the exam, guest students receive a certificate (by email or post) stating the exam grade."},
    {"courseID":"C9001","course":"Electives","name": "Social skills", "description": "1. Bavarian Culture \n 2. Personal and Professional Skills. \n 3.Communication & Rhetoric for Mentors \n 4. Cross-Cultural Teambuilding Workshop. \n 5. Education 4.0 - Digital Innovation Units. \n 6. Volunteering"},
    {"courseID":"C9002","course":"Electives","name": "Orientational knowledge", "description": "1. Astronomie und Astrophysik \n 2. Basics of International Sales and Business Development \n 3. Bavaria Israel Partnership Accelerator (BIPA) \n 4. Business Storytelling \n 5. Corporate Social Responsibility \n 6. EcoLab-News – News from Ecology and Economy \n 7. ECRI-Band \n 8. Einführung in die digitale Fotografie"},
    {"courseID":"C9003","course":"Electives","name": "Bavarian Virtual University (vhb)", "description": "In addition to the possibility of attending in-house courses at DIT, we would like to inform you about the courses offered by the Bavarian Virtual University (vhb). The vhb's online courses, which are flexible in terms of location and time, are available free of charge to enrolled students of Deggendorf Institute of Technology: https://www.vhb.org. \n Please note that only language courses and courses outside your subject area can be accredited – subject to case by case review. Please clarify any possible recognition of a vhb course as an elective (AWP) or compulsory language course in advance with Iris Bubenhofer."}


  ]